{"format": "layers-model", "generatedBy": "keras v2.9.0", "convertedBy": "TensorFlow.js Converter v3.19.0", "modelTopology": {"keras_version": "2.9.0", "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": {"name": "sequential_1", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 256, 256, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "conv2d_3_input"}}, {"class_name": "Conv2D", "config": {"name": "conv2d_3", "trainable": true, "batch_input_shape": [null, 256, 256, 3], "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_3", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"name": "conv2d_4", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_4", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"name": "conv2d_5", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_5", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "dtype": "float32", "rate": 0.3, "noise_shape": null, "seed": null}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true, "dtype": "float32", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"name": "dense_3", "trainable": true, "dtype": "float32", "units": 1024, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_4", "trainable": true, "dtype": "float32", "units": 512, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_5", "trainable": true, "dtype": "float32", "units": 2, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}}, "training_config": {"loss": "sparse_categorical_crossentropy", "metrics": [[{"class_name": "MeanMetricWrapper", "config": {"name": "accuracy", "dtype": "float32", "fn": "sparse_categorical_accuracy"}}]], "weighted_metrics": null, "loss_weights": null, "optimizer_config": {"class_name": "Adam", "config": {"name": "Adam", "learning_rate": 9.999999747378752e-05, "decay": 0.0, "beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "epsilon": 1e-07, "amsgrad": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of114.bin", "group1-shard2of114.bin", "group1-shard3of114.bin", "group1-shard4of114.bin", "group1-shard5of114.bin", "group1-shard6of114.bin", "group1-shard7of114.bin", "group1-shard8of114.bin", "group1-shard9of114.bin", "group1-shard10of114.bin", "group1-shard11of114.bin", "group1-shard12of114.bin", "group1-shard13of114.bin", "group1-shard14of114.bin", "group1-shard15of114.bin", "group1-shard16of114.bin", "group1-shard17of114.bin", "group1-shard18of114.bin", "group1-shard19of114.bin", "group1-shard20of114.bin", "group1-shard21of114.bin", "group1-shard22of114.bin", "group1-shard23of114.bin", "group1-shard24of114.bin", "group1-shard25of114.bin", "group1-shard26of114.bin", "group1-shard27of114.bin", "group1-shard28of114.bin", "group1-shard29of114.bin", "group1-shard30of114.bin", "group1-shard31of114.bin", "group1-shard32of114.bin", "group1-shard33of114.bin", "group1-shard34of114.bin", "group1-shard35of114.bin", "group1-shard36of114.bin", "group1-shard37of114.bin", "group1-shard38of114.bin", "group1-shard39of114.bin", "group1-shard40of114.bin", "group1-shard41of114.bin", "group1-shard42of114.bin", "group1-shard43of114.bin", "group1-shard44of114.bin", "group1-shard45of114.bin", "group1-shard46of114.bin", "group1-shard47of114.bin", "group1-shard48of114.bin", "group1-shard49of114.bin", "group1-shard50of114.bin", "group1-shard51of114.bin", "group1-shard52of114.bin", "group1-shard53of114.bin", "group1-shard54of114.bin", "group1-shard55of114.bin", "group1-shard56of114.bin", "group1-shard57of114.bin", "group1-shard58of114.bin", "group1-shard59of114.bin", "group1-shard60of114.bin", "group1-shard61of114.bin", "group1-shard62of114.bin", "group1-shard63of114.bin", "group1-shard64of114.bin", "group1-shard65of114.bin", "group1-shard66of114.bin", "group1-shard67of114.bin", "group1-shard68of114.bin", "group1-shard69of114.bin", "group1-shard70of114.bin", "group1-shard71of114.bin", "group1-shard72of114.bin", "group1-shard73of114.bin", "group1-shard74of114.bin", "group1-shard75of114.bin", "group1-shard76of114.bin", "group1-shard77of114.bin", "group1-shard78of114.bin", "group1-shard79of114.bin", "group1-shard80of114.bin", "group1-shard81of114.bin", "group1-shard82of114.bin", "group1-shard83of114.bin", "group1-shard84of114.bin", "group1-shard85of114.bin", "group1-shard86of114.bin", "group1-shard87of114.bin", "group1-shard88of114.bin", "group1-shard89of114.bin", "group1-shard90of114.bin", "group1-shard91of114.bin", "group1-shard92of114.bin", "group1-shard93of114.bin", "group1-shard94of114.bin", "group1-shard95of114.bin", "group1-shard96of114.bin", "group1-shard97of114.bin", "group1-shard98of114.bin", "group1-shard99of114.bin", "group1-shard100of114.bin", "group1-shard101of114.bin", "group1-shard102of114.bin", "group1-shard103of114.bin", "group1-shard104of114.bin", "group1-shard105of114.bin", "group1-shard106of114.bin", "group1-shard107of114.bin", "group1-shard108of114.bin", "group1-shard109of114.bin", "group1-shard110of114.bin", "group1-shard111of114.bin", "group1-shard112of114.bin", "group1-shard113of114.bin", "group1-shard114of114.bin"], "weights": [{"name": "conv2d_3/kernel", "shape": [3, 3, 3, 32], "dtype": "float32"}, {"name": "conv2d_3/bias", "shape": [32], "dtype": "float32"}, {"name": "conv2d_4/kernel", "shape": [3, 3, 32, 64], "dtype": "float32"}, {"name": "conv2d_4/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_5/kernel", "shape": [3, 3, 64, 128], "dtype": "float32"}, {"name": "conv2d_5/bias", "shape": [128], "dtype": "float32"}, {"name": "dense_3/kernel", "shape": [115200, 1024], "dtype": "float32"}, {"name": "dense_3/bias", "shape": [1024], "dtype": "float32"}, {"name": "dense_4/kernel", "shape": [1024, 512], "dtype": "float32"}, {"name": "dense_4/bias", "shape": [512], "dtype": "float32"}, {"name": "dense_5/kernel", "shape": [512, 2], "dtype": "float32"}, {"name": "dense_5/bias", "shape": [2], "dtype": "float32"}]}]}